import telebot
from telebot import types
import random

token = '6782863174:AAHBWRhvn9V5l4-qRfBRRdA9Tqy4wBr5Dhg'
bot = telebot.TeleBot(token)

phrases = [
    {
        "title": "Аж душа болить",
        "description": "нестерпно, дуже хочеться.",
        "example": "[Денис:] .. Коли б швидше розговлятися... їсти, аж душа болить (М. Кропивницький)."
    },
    {
        "title": "Аж душа радіє",
        "description": "хто-небудь дуже задоволений чимсь, відчуває радість, насолоду, втіху від чогось.",
        "example": "– Як стрінуся з просвіченим [освіченим] чоловіком, то в мене аж душа радіє (І. Нечуй-Левицький)."
    },
    {
        "title": "Бісова душа",
        "description": "уживається для вираження крайнього незадоволення кимсь; роздратування, обурення з "
                       "приводу чого-небудь.",
        "example": "Він [Варчук] .. повертає додому, обдумуючи дорогою, як найкраще віддячити Трояну. Бісова душа! .. "
                   "Господарів рівняє до нечистої сили (М. Стельмах)."
    },
    {
        "title": "Відкрита душа",
        "description": "хто-небудь прихильно, щиро ставиться до кого-небудь; хто-небудь чулий, чуйний до чогось.",
        "example": "— По гроші найясніший [князь] велів звернутися до вас... — Для вас, Антоне Андрійовичу, "
                   "завжди відкрита в мене душа (С. Добровольський)."
    },
    {
        "title": "Душа болить",
        "description": "хто-небудь дуже переживає, страждає з якогось приводу.",
        "example": "Полилась по срібній ночі Срібна пісня солов'я .. Защеміла, заболіла вся душа моя (Олександр Олесь)."
    },
    {
        "title": "Душа в душу",
        "description": "жити дружно, у злагоді; розмовляти щиро, відверто.",
        "example": "Він [Семен Іванович] .. частенько заглядав до брата на вечірній вогник. Брати жили, як то кажуть, "
                   "душа в душу (М. Рильський)."
    },
    {
        "title": "Душа вилітає з тіла",
        "description": "хто-небудь помирає, гине.",
        "example": "Вслід [Низ] .. стрілу пускає І просто Тагові в висок; Душа із тіла вилітає, "
                   "На жовтий пада труп пісок (І. Котляревський)."
    },
    {
        "title": "Душа в п’яти тікає",
        "description": "хто-небудь раптово відчуває сильний переляк; комусь стає страшно.",
        "example": "На кожній вибоїні, коли віз бувало перехиляється .. вся душа тікає в п’яти і "
                   "він часом аж спітніє зі страху (В. Гжицький)."
    },
    {
        "title": "Душа не з лопуцька",
        "description": "хто-небудь наділений позитивними рисами; сміливий, принциповий.",
        "example": "Люблю я таких людей, завзятих і проклятих, щоб душа в них була не з лопуцька (ІО. Яновський)."
    },
    {
        "title": "Душа держиться в тілі",
        "description": "хто-небудь ледве животіє, підтримуючи своє існування чим-небудь.",
        "example": "Передачі [в тюрму] приносили дуже рідко. Милосердніші роздавали одержану "
                   "паляницю на всіх — по шматочку. Тим і трималась душа в тілі (Ю. Збанацький)."
    },
    {
        "title": "Душа замутилась",
        "description": "хто-небудь втратив душевну рівновагу, спокій, стриманість і т. ін.",
        "example": "Чи могла Варвара слухати нестерпну, пристрасну річ дівчини? Замутилась душа, "
                   "аж потемніло в очах. Як вона сміє ставати матері наперекір? (К. Гордієнко)."
    },
    {
        "title": "Душа навстіж",
        "description": "хто-небудь відвертий, щирий у поводженні з іншими.",
        "example": "Добре, мабуть, оцьому Тимошеві — душа навстіж (С. Журахович)."
    },
    {
        "title": "Душа не приймає",
        "description": "не хочеться чого-небудь (їсти, пити і т. ін.).",
        "example": "Їв би очима, та душа не приймає (Укр. присл.)."
    },
    {
        "title": "Душа несе тягар",
        "description": "хто-небудь болісно переживає, тужить, страждає; комусь дуже важко.",
        "example": "Про що він [Хмельницький] думав, сам на сам з собою, опівночі, напередодні бою? "
                   "Який душа несла його тягар, про що тоді він радився із Богом? "
                   "Те знає лиш перо і каламар (Л. Костенко)."
    },
    {
        "title": "Душа обливається кров’ю",
        "description": "хто-небудь дуже страждає з якогось приводу.",
        "example": "Душа його [Ладенкова] обливалася кров’ю від переживань за невдачі на фронтах (П. Автомонов)."
    },
    {
        "title": "Душа огортається жалем",
        "description": "хто-небудь сповнений якимсь почуттям, глибоко вражений, схвильований.",
        "example": "Важким жалем огорнулась Михайлова душа при звістці, "
                   "що комісар Антоненко зовсім зліг (Ю. Збанацький)."
    },
    {
        "title": "Душа переставилася",
        "description": "хто-небудь помер.",
        "example": "Як зірочка покотиться, то душа переставиться (Панас Мирний)."
    },
    {
        "title": "Душа перетліла",
        "description": "хто-небудь настраждався, знемігся від почуття тривоги, страху, туги і т. ін.",
        "example": "— А мене не зобидили? Душа перетліла. Найкращу земельку як язиком корова злизала (М. Стельмах)."
    },
    {
        "title": "Душа поривається",
        "description": "хто-небудь відчуває нестримний потяг, прагнення до кого-, чого-небудь, бажання чогось.",
        "example": "Опущені з полудрабка босі ноги самі ворушились під стеливо далеких дівочих пісень, "
                   "а душа поривалась до них, бажаючи співати (М. Стельмах)."
    },
    {
        "title": "Душа пристала",
        "description": "хто-небудь уподобав, полюбив когось, щось.",
        "example": "Навіки пристала душа моя до тієї жінки, — на зріст невисокої, тихої і лагідної за вдачею, "
                   "великої трудівниці, яка мала велике серце і любила всіх людей (З газети)."
    },
    {
        "title": "Душа прощається з тілом",
        "description": "хто-небудь помирає.",
        "example": "Панський сторож .. тяжко дише.. Ось розкриває очі... То ними світить докора? "
                   "Чи посилає прокльони?.. Ні, то душа прощається з тілом (Панас Мирний)."
    },
    {
        "title": "Душа розм’якла",
        "description": "хто-небудь подобрішав, став податливим, згідливим, не чинить опору.",
        "example": "Я поки міг, то якось відгризався, А в неї ж [матері], знаєш, не язик — жало, "
                   "Що я намучивсь, що я натерзався! А потім здався, ради не було. "
                   "Душа розм'якла якось, заморилась, хоч коники ліпи, як зм'якуша. "
                   "До всього звикла, із усім змирилась (Л. Костенко)."
    },
    {
        "title": "Душа не лежить",
        "description": "хто-небудь не має інтересу, не відчуває прихильності, симпатії і т. ін. до кого-, чого-небудь; "
                       "хтось або щось не подобається.",
        "example": "Не скрию [не приховаю] від Вас, — підходили до мене тутешні знайомі запитувати про святкування. "
                   "Я одповів, що це все дурниця, до якої не лежить моя душа (Панас Мирний)."
    },
    {
        "title": "Душа не на місці",
        "description": "хто-небудь перебуває в стані тривоги, занепокоєння, дуже хвилюється, переживає.",
        "example": "Їде Федір за паном у двір — серце тремтить, душа не на місці (Панас Мирний)."
    },
    {
        "title": "Душа перевертається",
        "description": "хто-небудь відчуває гострий жаль, переймається співчуттям до когось — чогось; "
                       "у кого-небудь виникає гостре відчуття огиди до когось — чогось.",
        "example": "— Як бридко ти промовив сі слова! Душа моя од їх [них] перевернулась! (Леся Українка)."
    },
    {
        "title": "Душа рветься",
        "description": "хто-небудь дуже переживає за щось, страждає від чогось; хто-небудь нестримно прагне кудись, "
                       "до когось — чогось; хто-небудь помирає.",
        "example": "Серце мліє, смутні думки летять у невідомий край, а за ними рветься й душа, "
                   "бо немає для неї притулку на землі (О. Стороженко)."
    },
    {
        "title": "Душа розривається надвоє",
        "description": "хто-небудь дуже страждає від суперечливих почуттів, від неможливості вирішити щось, "
                       "допомогти чимсь і т. ін.",
        "example": "— Куди мені пристати? — крикнув Саїб, — що маю робити? "
                   "Душа моя розривається надвоє! (І. Нечуй-Левицький)."
    },
    {
        "title": "Душа скніє",
        "description": "хто-небудь переживає, хвилюється за когось, тяжко страждає, "
                       "охоплений почуттям жалю, туги і т. ін.",
        "example": "Хвора, серед самоти, уперше пізнала [Солоха], що їй тяжко: "
                   "душа .. скніла, серце нудилося (Панас Мирний)."
    },
    {
        "title": "Душа співає",
        "description": "хто-небудь перебуває в доброму, піднесеному настрої; радіє.",
        "example": "Батько Дніпро тече собі спокійно, і ліси на горах стоять, як на картині художника, "
                   "— просто душа співає од такої краси... (Ю. Яновський)."
    },
    {
        "title": "Душа сохне",
        "description": "кому-небудь щось дуже не подобається.",
        "example": "[Лінда:] Слухай, Вацеку .. Ти мені подобаєшся .. Але не говори зі мною про науку і вчених. "
                   "У мене сохне душа, коли я чую про атоми чи про ту твою протоплазму (О. Левада)."
    },
    {
        "title": "Душа стала на місце",
        "description": "хто-небудь заспокоївся, перестав тривожитися, хвилюватися.",
        "example": "Тільки тепер, коли він [Єгипта] повернувся і з ним нічого не сталось, Ліна відчула, "
                   "що душа її стала на місце і спатиме вона спокійно (О. Гончар)."
    },
    {
        "title": "Жива душа",
        "description": "людина; живий, з ознаками життя.",
        "example": "Єсть у мене діти, та де їх подіти? Заховать з собою? — гріх, душа жива (Т. Шевченко)."
    },
    {
        "title": "Заяча душа",
        "description": "боязка, полохлива людина; уживається для вираження незадоволення, роздратування "
                       "з приводу чого-небудь.",
        "example": "Нічого, крім презирства, в неї [Ольги] до цих паненят нема, всі вони заячі душі (Я. Качура)."
    },
    {
        "title": "Каїнова душа",
        "description": "зрадлива, підступна людина.",
        "example": "Люди зневажали його і називали каїновою душею за підлий характер (3 усн. мови)."
    },
    {
        "title": "Кипить душа",
        "description": "хто-небудь перебуває у стані сильного нервового збудження, хвилювання; "
                       "хто-небудь гнівається, сердиться на когось-щось, обурюється з приводу чогось.",
        "example": "— Душа в мене кипить од безчесної гадки! Через якісь погані .. "
                   "халупи хотять [хочуть] оддати на руїну осередок держави! (І. Нечуй-Левицький)."
    },
    {
        "title": "Куди тільки душа забажає",
        "description": "будь-куди, куди завгодно.",
        "example": "— А після лиману? Ще кудись були наміри [податися]? — Без намірів. "
                   "Куди душа забажає. . . Галасвіта (О. Гончар)."
    },
    {
        "title": "Ледве душа держиться",
        "description": "хто-небудь дуже слабий, кволий, ледве живий.",
        "example": "Значить, Ви ще пам ‘ятаєте, що десь далеко.. живе прихильна до Вас душа. "
                   "Правда, та душа ледве держиться в тілі (М. Коцюбинський)."
    },
    {
        "title": "Мишача душа",
        "description": "боязка, полохлива людина з дріб’язковістю, підлою вдачею.",
        "example": "— Великий Докучаєв!.. Мишачі душі з департаментів, скупі й лякливі (М. Рудь)."
    },
    {
        "title": "Ні одна жива душа",
        "description": "ніхто.",
        "example": "Густі ліси вкривали гори й яри .. В ті пущі не заходила ніколи ні одна жива душа "
                   "(І. Нечуй-Левицький)."
    },
    {
        "title": "Порожня душа",
        "description": "хто-небудь відчуває душевну спустошеність, байдужість до навколишнього світу, "
                       "перебуває у стані депресії.",
        "example": "Я тільки з рейду... Губи, мов крейда, порожня душа (В. Сосюра)."
    },
    {
        "title": "Скільки душа забажає",
        "description": "дуже багато, у великій кількості; досхочу, без будь-яких обмежень.",
        "example": "[Юсуф:] В мене срібла-золота скільки твоя душа забажає. Я всю тебе обсиплю золотом, "
                   "тільки будь весела! (І. Нечуй-Левицький)."
    },
    {
        "title": "Тільки душа в тілі",
        "description": "бідний, убогий.",
        "example": "\"Отак увесь вік свій прожила, — дума.. баба Сикліта, — тільки душа в тілі \" (Грицько Григоренко)."
    },
    {
        "title": "Тільки сама душа залишилася",
        "description": "хто-небудь зовсім зубожів, збіднів.",
        "example": "— Хоч би ще троячку накинули, — .. кидає фурман. — Май, Онуфрію, совість! "
                   "— гримнула на нього Петрівна. — Бачиш, що у чоловіка тільки сама душа залишилася (М. Стельмах)."
    },
    {
        "title": "Черства душа",
        "description": "хто-небудь нечуйний, байдужий.",
        "example": "[Прохор:] Ти .. брат, а душа в тебе черства (І. Микитенко); "
                   "— Фесенко людина з черствим серцем, людина з матеріальним поглядом на все (І. Нечуй-Левицький)."
    },
    {
        "title": "Чого тільки душа забажає",
        "description": "у достатній кількості, доволі; те, до чого хто-небудь має потяг або чого хоче досягти.",
        "example": "Нічого Бога гнівити, досі ми гаразд малися. Було всього, чого тільки душа бажа (І. Чендей)."
    },
    {
        "title": "Чорнильна душа",
        "description": "хто-небудь обмежений у своїй діяльності вузькими службовими обов’язками, "
                       "інтересами; бюрократ, канцелярист.",
        "example": "— Нетаючись, скажу тобі: чорнильна душа була в мене. Опріч казенщини "
                   "— там губернських та сенатських відомостей — і в руки нічого не хотілось узяти (М. Коцюбинський)."
    },
    {
        "title": "Широка душа",
        "description": "хто-небудь чуйний, щедрий, щирий; чуйна, щедра, щира вдача у кого-небудь.",
        "example": "[Вася:] Що тобі відомо? Мені відомо тільки, що в нього широка і щира душа (І. Микитенко)."
    },
    {
        "title": "Щира душа",
        "description": "чесна, відверта, щедра, доброзичлива людина.",
        "example": "Прохор Осауленко був козак не з величних, щира душа, себе на посміх не подасть (П. Куліш)."
    },
    {
        "title": "Як душа до душі",
        "description": "щиро, відверто, правдиво.",
        "example": "Дівчино-серденько! Скажи нам усю щиру правду, як душа до душі (Марко Вовчок)."
    },
    {
        "title": "Як одна душа",
        "description": "дружно, в злагоді.",
        "example": "І зажили молоді як одна душа — дружно, весело (3 усн. мови)."
    },
    {
        "title": "По душах",
        "description": "щиро, відверто, щиросердно.",
        "example": "Інші, мовляв, по кабінетах, на телефонах сидять, а він не з таких .. "
                   "Звик отут, на місці, .. настрій маси вивчати. Тут з роботягами побесідуєш по душах, "
                   "щось їм цікаве підкинеш... (О.Гончар)."
    },
    {
        "title": "Душею і серцем",
        "description": "самовіддано, щиро.",
        "example": "Душем і серцем до Вас прихильний П. Рудченко (Панас Мирний)."
    },
    {
        "title": "Душею і тілом",
        "description": "повністю, до кінця, всім єством; щиро, самовіддано; у всіх відношеннях.",
        "example": "Душею і тілом був [Глухенький] відданий артілі (О. Гончар)."
    },
    {
        "title": "За душею",
        "description": "при собі, у власності, у наявності; затаїти у собі.",
        "example": "Ну-ну, сестро, ну! Викладай, викладай, що затаїла за душею (Панас Мирний)."
    },
    {
        "title": "З відкритою душею",
        "description": "щиро, радісно.",
        "example": "— Знаєш, як тебе там зустрінуть? Бачив, як нас зустрічала Словакія? "
                   "З дзвонами, квітами, з відкритою душею! (О. Гончар)."
    },
    {
        "title": "З дорогою душею",
        "description": "охоче, з великим задоволенням, з радістю.",
        "example": "[Храпко:] Нуте лиш, я вам оце дільце припоручу. [Печариця:] "
                   "Я з дорогою душею, та чи втну його? (Панас Мирний)."
    },
    {
        "title": "З душею",
        "description": "повністю, до кінця.",
        "example": "Ви, може, читали [поетові] вірші і переклади в 'Правді'. "
                   "З 'їли хлопця, схрупали з душею (Леся Українка)."
    },
    {
        "title": "Над душею",
        "description": "набридливо, невідступно перебувати біля кого-небудь.",
        "example": "Йому [Миколі] заманулося піти до неї [Нимидори], .. хоч подивитися на неї, "
                   "та гуменний стовбичив над душею (І. Нечуй-Левицький)."
    },
    {
        "title": "Без душі",
        "description": "дуже сильно, до самозабуття; заст. Мертвий; дуже переляканий; "
                       "сухо, формально, по-казенному.",
        "example": "[Виборний:] Наталка без душі його [Петра] любить, через його всім женихам одказує "
                   "(І. Котляревський)."
    },
    {
        "title": "В душі",
        "description": "приховано, нишком, не виявляючи зовні своїх почуттів.",
        "example": "— Я розскрекоталась, як сорока, а ви .. мовчите. Певне, "
                   "смієтеся в душі наді мною, що так безнастанно говорю! (Л. Мартович)."
    },
    {
        "title": "Від усієї душі",
        "description": "щиро, глибоко, сердечно; нестримно, невимушено; з великим задоволенням; "
                       "відверто, нічого не приховуючи; дже сумлінно, з надзвичайною старанністю.",
        "example": "Дзвеніла [пісня] в зоряній тиші, у простір місячний лилася про тих дівчат, "
                   "що на Донбасі усе робили від душі (О. Гончар)."
    },
    {
        "title": "Для душі",
        "description": "для задоволення власних духовних запитів, потреб.",
        "example": "Для душі художник писав не респектабельних чиновників чи їхніх .. дружин. "
                   "Своїх натурщиків він шукав на вулицях.., на .. базарах і в маленьких шинках (3 журналу)."
    },
    {
        "title": "До душі",
        "description": "подобатися; відповідний чиїм-небудь уподобанням, смакам.",
        "example": "Іван Михалчевський був нежонатий. Йому вже минуло двадцять шість років, "
                   "і він не міг знайти собі дівчину до душі (І. Нечуй-Левицький)."
    },
    {
        "title": "Жодної живої душі",
        "description": "нікого.",
        "example": "Настала така тиша, наче на всьому дворі не було живої душі (І. Нечуй-Левицький)."
    },
    {
        "title": "На душі",
        "description": "хто-небудь сповнений якимись почуттями, відчуває щось.",
        "example": "Нікого не цікавить, що було у вас на душі або дома, коли ви робили фільм .. "
                   "Ви мусите показати товар лицем (О. Довженко)."
    },
    {
        "title": "Ні живої душі",
        "description": "абсолютно нікого, жодної людини.",
        "example": "Хоч ні душі нема близько, а їй здається, буцімто усі люди так на неї і "
                   "дивляться (Г. Квітка-Основ’яненко)."
    },
    {
        "title": "В одну душу",
        "description": "настирливо, набридливо; невідступно вимагати що-небудь.",
        "example": "Важко було заспокоїти дитину, що верещала в одну душу (Грицько Григоренко)."
    },
    {
        "title": "За милу душу",
        "description": "з великим задоволенням, охоче; добре, прекрасно, надійно.",
        "example": "...— Пий, Гошко, бо ти дурний.. Я б тобі вліпив кулю в потилицю за милу душу (Григорій Тютюнник)."
    },
    {
        "title": "За пухлу душу",
        "description": "марно, даром.",
        "example": "Марно, даром. Робить за пухлого душу (Укр.. присл..)."
    },
    {
        "title": "З горобину душу",
        "description": "дуже мало.",
        "example": "Там у нього [у турка] війська було з горобину душу (С. Добровольський)."
    },
    {
        "title": "Ні за цапову душу",
        "description": "марно, даром; ні за що.",
        "example": "Пропав ні за цапову душу (Укр.. присл..)."
    },
    {
        "title": "Як свою душу",
        "description": "дуже (любити).",
        "example": "Дуже. Поважав же і він [Наум] її [дружину], скільки міг, і любив її як свою душу "
                   "(Г. Квітка-Основ’яненко)."
    }
]


current_index = 0

def get_chat_id(update, context):
  chat_id = -1

  if update.message is not None:
    chat_id = update.message.chat.id
  elif update.callback_query is not None:
    chat_id = update.callback_query.message.chat.id
  elif update.poll is not None:
    chat_id = context.bot_data[update.poll.id]

  return chat_id

@bot.message_handler(commands=['start'])
def greet(message):
    markup = types.ReplyKeyboardMarkup()
    markup.row(types.KeyboardButton("допомога"))
    markup.row(types.KeyboardButton("завчити"))
    markup.row(types.KeyboardButton("пройти тестування"))
    bot.send_message(message.chat.id, "Привіт! Я твій помічник у вивченні фразеологізмів. Обери режим!",
                     reply_markup=markup)

@bot.message_handler(func=lambda message: message.text == "допомога")
def send_help(message):
    bot.send_message(message.chat.id,
                     "Бот має два режими вивчення фразеологізмів. Натисни кнопку 'завчити', якщо хочеш "
                     "завчити фразеологізми! Натисни кнопку 'пройти тестування', якщо хочеш перевірити свої знання!")

@bot.message_handler(func=lambda message: message.text == "завчити")
def send_cramming(message):
    global current_index
    phrase = phrases[current_index]
    markup = types.ReplyKeyboardMarkup()
    markup.row(types.KeyboardButton("наступний фразеологізм"))
    markup.row(types.KeyboardButton("назад"))
    bot.send_message(message.chat.id, phrase["title"] + " - " + phrase["description"] + "\n" + "Приклад: "
                     + phrase["example"], reply_markup=markup)

quizzes = [
    {"question": "Аж душа болить:", "options": ["нестерпно",
                                                "жити дружно, у злагоді",
                                                "хто-небудь помирає"], "correct_option_id": 0},
    {"question": "Аж душа радіє:", "options": ["доброзичлива людина",
                                               "хто-небудь дуже задоволений чимсь", "самовіддано"], "correct_option_id": 1},
    {"question": "Бісова душа:", "options": ["хто-небудь перебуває в стані тривоги",
                                             "зрадлива людина",
                                             "для вираження незадоволення кимсь"],
                                             "correct_option_id": 2},
    {"question": "Відкрита душа:", "options": ["хто-небудь прихильно ставиться до когось",
                                               "з великим задоволенням",
                                               "набридливо перебувати біля когось"],
                                               "correct_option_id": 0},
    {"question": "Душа болить:", "options": ["хто-небудь чуйний",
                                             "хто-небудь дуже переживає",
                                             "щиро, відверто"], "correct_option_id": 1},
    {"question": "Душа в душу:", "options": ["хто-небудь відчуває щось",
                                             "хто-небудь відчуває душевну спустошеність",
                                             "жити дружно"], "correct_option_id": 2},
    {"question": "Душа вилітає з тіла:", "options": ["хто-небудь помирає",
                                                     "хто-небудь перебуває в доброму настрої",
                                                     "хто-небудь відчуває щось"],
                                                     "correct_option_id": 0},
    {"question": "Душа в п'яти тікає:", "options": ["хто-небудь ледве животіє",
                                                    "хто-небудь раптово відчуває сильний переляк",
                                                    "хто-небудь відчуває гострий жаль"], "correct_option_id": 1},
    {"question": "Душа не з лопуцька:", "options": ["бідний",
                                                    "набридливо перебувати біля кого-небудь",
                                                    "хто-небудь наділений позитивними рисами"], "correct_option_id": 2},
    {"question": "Душа держиться в тілі:", "options": ["хто-небудь ледве животіє",
                                                       "для задоволення власних духовних запитів",
                                                       "з великим задоволенням"], "correct_option_id": 0},
    {"question": "Душа замутилась:", "options": ["хто-небудь заспокоївся",
                                                 "хто-небудь втратив спокій",
                                                 "людина"], "correct_option_id": 1},
    {"question": "Душа навстіж:", "options": ["охоче",
                                              "настирливо",
                                              "хто-небудь відвертий, щирий у поводженні з іншими"],
                                              "correct_option_id": 2},
    {"question": "Душа не приймає:", "options": ["не хочеться чого-небудь",
                                                 "хто-небудь помер",
                                                 "хто-небудь нечуйний, байдужий"], "correct_option_id": 0},
    {"question": "Душа несе тягар:", "options": ["нестерпно, дуже хочеться",
                                                 "хто-небудь болісно переживає",
                                                 "хто-небудь раптово відчуває сильний переляк"],
                                                 "correct_option_id": 1},
    {"question": "Душа обливається кров'ю:", "options": ["бідний, убогий", "хто-небудь чуйний",
                                                         "хто-небудь дуже страждає"],
                                                         "correct_option_id": 2},
    {"question": "Душа огортається жалем:", "options": ["хто-небудь сповнений почуттям",
                                                        "уживається для вираження незадоволення",
                                                        "хто-небудь дуже задоволений"], "correct_option_id": 0},
    {"question": "Душа переставилася:", "options": ["хто-небудь сповнений почуттями",
                                                    "хто-небудь помер", "людина"], "correct_option_id": 1},
    {"question": "Душа перетліла:", "options": ["повністю, до кінця",
                                                "хто-небудь зовсім зубожів",
                                                "хто-небудь настраждався"], "correct_option_id": 2},
    {"question": "Душа поривається:", "options": ["хто-небудь відчуває нестримний потяг",
                                                  "хто-небудь відчуває гострий жаль",
                                                  "хто-небудь заспокоївся"],
                                                  "correct_option_id": 0},
    {"question": "Душа пристала:", "options": ["хто-небудь помирає", "хто-небудь уподобав",
                                               "хто-небудь подобрішав"],
                                               "correct_option_id": 1},
    {"question": "Душа прощається з тілом:", "options": ["хто-небудь дуже слабий",
                                                         "хто-небудь подобрішав", "хто-небудь помирає"],
                                                         "correct_option_id": 2},
    {"question": "Душа розм'якла:", "options": ["хто-небудь подобрішав",
                                                "хто-небудь перебуває в доброму настрої", "людина"],
                                                "correct_option_id": 0},
    {"question": "Душа не лежить:", "options": ["зрадлива, підступна людина",
                                                "хто-небудь не має інтересу",
                                                "хто-небудь перебуває в стані тривоги"], "correct_option_id": 1},
    {"question": "Душа не на місці:", "options": ["хто-небудь не має інтересу",
                                                  "кому-небудь щось дуже не подобається",
                                                  "хто-небудь перебуває в стані тривоги"],
                                                  "correct_option_id": 2},
    {"question": "Душа перевертається:", "options": ["хто-небудь відчуває гострий жаль",
                                                     "хто-небудь переживає",
                                                     "хто-небудь заспокоївся"], "correct_option_id": 0},
    {"question": "Душа рветься:", "options": ["боязка, полохлива людина",
                                              "хто-небудь дуже переживає за щось",
                                              "хто-небудь зовсім зубожів"], "correct_option_id": 1},
    {"question": "Душа розривається надвоє:", "options": ["хто-небудь заспокоївся",
                                                          "кому-небудь дуже не подобається",
                                                          "хто-небудь страждає від суперечливих почуттів"],
                                                          "correct_option_id": 2},
    {"question": "Душа скніє:", "options": ["хто-небудь переживає",
                                            "хто-небудь страждає від суперечливих почуттів",
                                            "хто-небудь не має інтересу"
                                            "до кого-, чого-небудь"], "correct_option_id": 0},
    {"question": "Душа співає:", "options": ["хто-небудь хвилюється",
                                             "хто-небудь перебуває в доброму настрої",
                                             "кому-небудь щось дуже не подобається"], "correct_option_id": 1},
    {"question": "Душа сохне:", "options": ["хто-небудь дуже слабий",
                                            "хто-небудь заспокоївся",
                                            "кому-небудь щось дуже не подобається"], "correct_option_id": 2},
    {"question": "Душа стала на місце:", "options": ["хто-небудь заспокоївся",
                                                     "то-небудь перебуває в стані тривоги",
                                                     "хто-небудь не має інтересу"],
                                                     "correct_option_id": 0},
    {"question": "Жива душа:", "options": ["хто-небудь дуже слабий",
                                           "людина",
                                           "хто-небудь чуйний"], "correct_option_id": 1},
    {"question": "Заяча душа:", "options": ["бідний, убогий", "зрадлива, підступна людина",
                                            "боязка, полохлива людина"], "correct_option_id": 2},
    {"question": "Каїнова душа:", "options": ["зрадлива людина",
                                              "боязка, полохлива людина з дріб’язковістю",
                                              "хто-небудь зовсім зубожів"], "correct_option_id": 0},
    {"question": "Кипить душа:", "options": ["хто-небудь відчуває душевну спустошеність",
                                             "хто-небудь перебуває у стані хвилювання",
                                             "хто-небудь слабий"], "correct_option_id": 1},
    {"question": "Куди тільки душа забажає:", "options": ["щиро, відверто, правдиво",
                                                          "дружно",
                                                          "будь-куди"], "correct_option_id": 2},
    {"question": "Ледве душа держиться:", "options": ["хто-небудь дуже слабий",
                                                      "бідний, убогий",
                                                      "хто-небудь нечуйний, байдужий"], "correct_option_id": 0},
    {"question": "Мишача душа:", "options": ["хто-небудь відчуває душевну спустошеність",
                                             "боязка людина з дріб’язковістю",
                                             "хто-небудь дуже слабий"], "correct_option_id": 1},
    {"question": "Ні одна жива душа:", "options": ["хто-небудь заспокоївся",
                                                   "хто-небудь нечуйний", "ніхто"], "correct_option_id": 2},
    {"question": "Порожня душа:", "options": ["хто-небудь відчуває спустошеність",
                                              "хто-небудь зубожів",
                                              "хто-небудь обмежений у своїй діяльності вузькими службовими "
                                              "обов’язками"], "correct_option_id": 0},
    {"question": "Скільки душа забажає:", "options": ["дуже сильно",
                                                      "дуже багато",
                                                      "набридливо перебувати біля кого-небудь"],
     "correct_option_id": 1},
    {"question": "Тільки душа в тілі:", "options": ["хто-небудь обмежений у своїй діяльності вузькими "
                                                    "службовими обов’язками",
                                                    "нечуйний",
                                                    "бідний"], "correct_option_id": 2},
    {"question": "Тільки сама душа залишилася:", "options": ["хто-небудь зубожів",
                                                             "хто-небудь помирає",
                                                             "хто-небудь подобрішав, став згідливим"], "correct_option_id": 0},
    {"question": "Черства душа:", "options": ["боязка, полохлива людина з дріб’язковістю",
                                              "нечуйний",
                                              "хто-небудь відчуває душевну спустошеність"],
                                              "correct_option_id": 1},
    {"question": "Чого тільки душа забажає:", "options": ["для задоволення власних духовних запитів",
                                                          "приховано",
                                                          "у достатній кількості"], "correct_option_id": 2},
    {"question": "Чорнильна душа:", "options": ["обмежений у своїй діяльності вузькими службовими "
                                                "обов’язками",
                                                "чуйний",
                                                "хто-небудь не має інтересу"],
                                                "correct_option_id": 0},
    {"question": "Широка душа:", "options": ["подобрішав, став згідливим",
                                             "чуйний",
                                             "хто-небудь дуже переживає за щось"],
                                             "correct_option_id": 1},
    {"question": "Щира душа:", "options": ["перебуває в піднесеному настрої",
                                           "відчуває гострий жаль",
                                           "доброзичлива людина"], "correct_option_id": 2},
    {"question": "Як душа до душі:", "options": ["щиро, відверто, правдиво",
                                                 "подобатися",
                                                 "дуже (любити)"], "correct_option_id": 0},
    {"question": "Як одна душа:", "options": ["повністю, до кінця", "дружно, в злагоді", "марно, даром"],
                                              "correct_option_id": 1},
    {"question": "По душах:", "options": ["дуже багато",
                                          "для задоволення власних духовних запитів",
                                          "щиро, відверто, щиросердно"], "correct_option_id": 2},
    {"question": "Душею і серцем:", "options": ["самовіддано, щиро", "дружно, в злагоді",
                                                "зовсім зубожів"], "correct_option_id": 0},
    {"question": "Душею і тілом:", "options": ["настирливо, набридливо", "повністю, до кінця",
                                               "дружно, в злагоді"], "correct_option_id": 1},
    {"question": "За душею:", "options": ["з великим задоволенням, охоче",
                                          "хто-небудь сповнений якимись почуттями",
                                          "при собі, у власності"], "correct_option_id": 2},
    {"question": "З відкритою душею:", "options": ["щиро, радісно", "повністю, до кінця",
                                                   "хто-небудь зубожів"], "correct_option_id": 0},
    {"question": "З дорогою душею:", "options": ["повністю, до кінця",
                                                 "охоче",
                                                 "марно, даром"], "correct_option_id": 1},
    {"question": "З душею:", "options": ["щиро, радісно", "охоче",
                                         "повністю, до кінця"], "correct_option_id": 2},
    {"question": "Над душею:", "options": ["набридливо перебувати біля кого-небудь",
                                           "при собі, у власності", "дуже багато"],
                                           "correct_option_id": 0},
    {"question": "Без душі:", "options": ["хто-небудь зовсім зубожів", "дуже сильно, до самозабуття",
                                          "у достатній кількості"], "correct_option_id": 1},
    {"question": "В душі:", "options": ["щиро, радісно", "самовіддано, щиро",
                                        "приховано, нишком"], "correct_option_id": 2},
    {"question": "Від усієї душі:", "options": ["щиро, глибоко, сердечно", "повністю, до кінця",
                                                "при собі, у власності"], "correct_option_id": 0},
    {"question": "Для душі:", "options": ["дуже мало", "для задоволення власних духовних запитів",
                                          "охоче, з великим задоволенням"], "correct_option_id": 1},
    {"question": "До душі:", "options": ["дуже (любити)", "щиро, відверто, правдиво",
                                         "подобатися"], "correct_option_id": 2},
    {"question": "Жодної живої душі:", "options": ["нікого", "приховано, нишком",
                                                   "бідний, убогий"], "correct_option_id": 0},
    {"question": "На душі:", "options": ["набридливо перебувати біля кого-небудь",
                                         "хто-небудь сповнений якимись почуттями",
                                         "при собі, у власності"], "correct_option_id": 1},
    {"question": "Ні живої душі:", "options": ["хто-небудь помирає", "марно, даром",
                                               "абсолютно нікого"], "correct_option_id": 2},
    {"question": "В одну душу:", "options": ["настирливо, набридливо", "дуже (любити)",
                                             "щиро, глибоко, сердечно"], "correct_option_id": 0},
    {"question": "За милу душу:", "options": ["марно, даром", "з великим задоволенням, охоче",
                                              "дуже мало"], "correct_option_id": 1},
    {"question": "За пухлу душу:", "options": ["бідний, убогий", "дуже мало", "марно, даром"], "correct_option_id": 2},
    {"question": "З горобину душу:", "options": ["дуже мало", "марно, даром",
                                                 " щиро, відверто, щиросердно"], "correct_option_id": 0},
    {"question": "Ні за цапову душу:", "options": ["настирливо, набридливо", "марно, даром",
                                                   "дуже мало"], "correct_option_id": 1},
    {"question": "Як свою душу:", "options": ["повністю, до кінця", "для задоволення власних духовних потреб",
                                              "дуже (любити)"], "correct_option_id": 2}
]

current_quiz = None

@bot.message_handler(func=lambda message: message.text == "пройти тестування")
def send_test(message):
    global current_quiz
    current_quiz = random.choice(quizzes)
    markup = types.ReplyKeyboardMarkup()
    markup.row(types.KeyboardButton("наступний тест"))
    markup.row(types.KeyboardButton("назад"))
    bot.send_poll(reply_markup=markup, chat_id=message.chat.id, type="quiz", question=current_quiz["question"],
                  options=current_quiz["options"], correct_option_id=current_quiz["correct_option_id"])

@bot.message_handler(func=lambda message: message.text == "наступний фразеологізм")
def next_phrase(message):
    global current_index
    current_index = (current_index + 1) % len(phrases)
    phrase = phrases[current_index]
    markup = types.ReplyKeyboardMarkup()
    markup.row(types.KeyboardButton("наступний фразеологізм"))
    markup.row(types.KeyboardButton("назад"))
    bot.send_message(message.chat.id, phrase["title"] + " - " + phrase["description"] + "\n" + "Приклад: "
                     + phrase["example"], reply_markup=markup)

@bot.message_handler(func=lambda message: message.text == "наступний тест")
def next_test(message):
    global current_quiz
    current_quiz = random.choice(quizzes)
    markup = types.ReplyKeyboardMarkup()
    markup.row(types.KeyboardButton("наступний тест"))
    markup.row(types.KeyboardButton("назад"))
    bot.send_poll(chat_id=message.chat.id, type="quiz", question=current_quiz["question"],
                  options=current_quiz["options"], correct_option_id=current_quiz["correct_option_id"])


@bot.message_handler(func=lambda message: message.text == "назад")
def back_to_menu(message):
    markup = types.ReplyKeyboardMarkup()
    markup.row(types.KeyboardButton("допомога"))
    markup.row(types.KeyboardButton("завчити"))
    markup.row(types.KeyboardButton("пройти тестування"))
    bot.send_message(message.chat.id, "Обери режим!", reply_markup=markup)

bot.polling()
