phrases = [
    {
        "title": "Аж душа болить",
        "description": "нестерпно, дуже хочеться.",
        "example": "[Денис:] .. Коли б швидше розговлятися... їсти, аж душа болить (М. Кропивницький)."
    },
    {
        "title": "Аж душа радіє",
        "description": "хто-небудь дуже задоволений чимсь, відчуває радість, насолоду, втіху від чогось.",
        "example": "– Як стрінуся з просвіченим [освіченим] чоловіком, то в мене аж душа радіє (І. Нечуй-Левицький)."
    },
    {
        "title": "Бісова душа",
        "description": "уживається для вираження крайнього незадоволення кимсь; роздратування, обурення з "
                       "приводу чого-небудь.",
        "example": "Він [Варчук] .. повертає додому, обдумуючи дорогою, як найкраще віддячити Трояну. Бісова душа! .. "
                   "Господарів рівняє до нечистої сили (М. Стельмах)."
    },
    {
        "title": "Відкрита душа",
        "description": "хто-небудь прихильно, щиро ставиться до кого-небудь; хто-небудь чулий, чуйний до чогось.",
        "example": "— По гроші найясніший [князь] велів звернутися до вас... — Для вас, Антоне Андрійовичу, "
                   "завжди відкрита в мене душа (С. Добровольський)."
    },
    {
        "title": "Душа болить",
        "description": "хто-небудь дуже переживає, страждає з якогось приводу.",
        "example": "Полилась по срібній ночі Срібна пісня солов'я .. Защеміла, заболіла вся душа моя (Олександр Олесь)."
    },
    {
        "title": "Душа в душу",
        "description": "жити дружно, у злагоді; розмовляти щиро, відверто.",
        "example": "Він [Семен Іванович] .. частенько заглядав до брата на вечірній вогник. Брати жили, як то кажуть, "
                   "душа в душу (М. Рильський)."
    },
    {
        "title": "Душа вилітає з тіла",
        "description": "хто-небудь помирає, гине.",
        "example": "Вслід [Низ] .. стрілу пускає І просто Тагові в висок; Душа із тіла вилітає, "
                   "На жовтий пада труп пісок (І. Котляревський)."
    },
    {
        "title": "Душа в п’яти тікає",
        "description": "хто-небудь раптово відчуває сильний переляк; комусь стає страшно.",
        "example": "На кожній вибоїні, коли віз бувало перехиляється .. вся душа тікає в п’яти і "
                   "він часом аж спітніє зі страху (В. Гжицький)."
    },
    {
        "title": "Душа не з лопуцька",
        "description": "хто-небудь наділений позитивними рисами; сміливий, принциповий.",
        "example": "Люблю я таких людей, завзятих і проклятих, щоб душа в них була не з лопуцька (ІО. Яновський)."
    },
    {
        "title": "Душа держиться в тілі",
        "description": "хто-небудь ледве животіє, підтримуючи своє існування чим-небудь.",
        "example": "Передачі [в тюрму] приносили дуже рідко. Милосердніші роздавали одержану "
                   "паляницю на всіх — по шматочку. Тим і трималась душа в тілі (Ю. Збанацький)."
    },
    {
        "title": "Душа замутилась",
        "description": "хто-небудь втратив душевну рівновагу, спокій, стриманість і т. ін.",
        "example": "Чи могла Варвара слухати нестерпну, пристрасну річ дівчини? Замутилась душа, "
                   "аж потемніло в очах. Як вона сміє ставати матері наперекір? (К. Гордієнко)."
    },
    {
        "title": "Душа навстіж",
        "description": "хто-небудь відвертий, щирий у поводженні з іншими.",
        "example": "Добре, мабуть, оцьому Тимошеві — душа навстіж (С. Журахович)."
    },
    {
        "title": "Душа не приймає",
        "description": "не хочеться чого-небудь (їсти, пити і т. ін.).",
        "example": "Їв би очима, та душа не приймає (Укр. присл.)."
    },
    {
        "title": "Душа несе тягар",
        "description": "хто-небудь болісно переживає, тужить, страждає; комусь дуже важко.",
        "example": "Про що він [Хмельницький] думав, сам на сам з собою, опівночі, напередодні бою? "
                   "Який душа несла його тягар, про що тоді він радився із Богом? "
                   "Те знає лиш перо і каламар (Л. Костенко)."
    },
    {
        "title": "Душа обливається кров’ю",
        "description": "хто-небудь дуже страждає з якогось приводу.",
        "example": "Душа його [Ладенкова] обливалася кров’ю від переживань за невдачі на фронтах (П. Автомонов)."
    },
    {
        "title": "Душа огортається жалем",
        "description": "хто-небудь сповнений якимсь почуттям, глибоко вражений, схвильований.",
        "example": "Важким жалем огорнулась Михайлова душа при звістці, "
                   "що комісар Антоненко зовсім зліг (Ю. Збанацький)."
    },
    {
        "title": "Душа переставилася",
        "description": "хто-небудь помер.",
        "example": "Як зірочка покотиться, то душа переставиться (Панас Мирний)."
    },
    {
        "title": "Душа перетліла",
        "description": "хто-небудь настраждався, знемігся від почуття тривоги, страху, туги і т. ін.",
        "example": "— А мене не зобидили? Душа перетліла. Найкращу земельку як язиком корова злизала (М. Стельмах)."
    },
    {
        "title": "Душа поривається",
        "description": "хто-небудь відчуває нестримний потяг, прагнення до кого-, чого-небудь, бажання чогось.",
        "example": "Опущені з полудрабка босі ноги самі ворушились під стеливо далеких дівочих пісень, "
                   "а душа поривалась до них, бажаючи співати (М. Стельмах)."
    },
    {
        "title": "Душа пристала",
        "description": "хто-небудь уподобав, полюбив когось, щось.",
        "example": "Навіки пристала душа моя до тієї жінки, — на зріст невисокої, тихої і лагідної за вдачею, "
                   "великої трудівниці, яка мала велике серце і любила всіх людей (З газети)."
    },
    {
        "title": "Душа прощається з тілом",
        "description": "хто-небудь помирає.",
        "example": "Панський сторож .. тяжко дише.. Ось розкриває очі... То ними світить докора? "
                   "Чи посилає прокльони?.. Ні, то душа прощається з тілом (Панас Мирний)."
    },
    {
        "title": "Душа розм’якла",
        "description": "хто-небудь подобрішав, став податливим, згідливим, не чинить опору.",
        "example": "Я поки міг, то якось відгризався, А в неї ж [матері], знаєш, не язик — жало, "
                   "Що я намучивсь, що я натерзався! А потім здався, ради не було. "
                   "Душа розм'якла якось, заморилась, хоч коники ліпи, як зм'якуша. "
                   "До всього звикла, із усім змирилась (Л. Костенко)."
    },
    {
        "title": "Душа не лежить",
        "description": "хто-небудь не має інтересу, не відчуває прихильності, симпатії і т. ін. до кого-, чого-небудь; "
                       "хтось або щось не подобається.",
        "example": "Не скрию [не приховаю] від Вас, — підходили до мене тутешні знайомі запитувати про святкування. "
                   "Я одповів, що це все дурниця, до якої не лежить моя душа (Панас Мирний)."
    },
    {
        "title": "Душа не на місці",
        "description": "хто-небудь перебуває в стані тривоги, занепокоєння, дуже хвилюється, переживає.",
        "example": "Їде Федір за паном у двір — серце тремтить, душа не на місці (Панас Мирний)."
    },
    {
        "title": "Душа перевертається",
        "description": "хто-небудь відчуває гострий жаль, переймається співчуттям до когось — чогось; "
                       "у кого-небудь виникає гостре відчуття огиди до когось — чогось.",
        "example": "— Як бридко ти промовив сі слова! Душа моя од їх [них] перевернулась! (Леся Українка)."
    },
    {
        "title": "Душа рветься",
        "description": "хто-небудь дуже переживає за щось, страждає від чогось; хто-небудь нестримно прагне кудись, "
                       "до когось — чогось; хто-небудь помирає.",
        "example": "Серце мліє, смутні думки летять у невідомий край, а за ними рветься й душа, "
                   "бо немає для неї притулку на землі (О. Стороженко)."
    },
    {
        "title": "Душа розривається надвоє",
        "description": "хто-небудь дуже страждає від суперечливих почуттів, від неможливості вирішити щось, "
                       "допомогти чимсь і т. ін.",
        "example": "— Куди мені пристати? — крикнув Саїб, — що маю робити? "
                   "Душа моя розривається надвоє! (І. Нечуй-Левицький)."
    },
    {
        "title": "Душа скніє",
        "description": "хто-небудь переживає, хвилюється за когось, тяжко страждає, "
                       "охоплений почуттям жалю, туги і т. ін.",
        "example": "Хвора, серед самоти, уперше пізнала [Солоха], що їй тяжко: "
                   "душа .. скніла, серце нудилося (Панас Мирний)."
    },
    {
        "title": "Душа співає",
        "description": "хто-небудь перебуває в доброму, піднесеному настрої; радіє.",
        "example": "Батько Дніпро тече собі спокійно, і ліси на горах стоять, як на картині художника, "
                   "— просто душа співає од такої краси... (Ю. Яновський)."
    },
    {
        "title": "Душа сохне",
        "description": "кому-небудь щось дуже не подобається.",
        "example": "[Лінда:] Слухай, Вацеку .. Ти мені подобаєшся .. Але не говори зі мною про науку і вчених. "
                   "У мене сохне душа, коли я чую про атоми чи про ту твою протоплазму (О. Левада)."
    },
    {
        "title": "Душа стала на місце",
        "description": "хто-небудь заспокоївся, перестав тривожитися, хвилюватися.",
        "example": "Тільки тепер, коли він [Єгипта] повернувся і з ним нічого не сталось, Ліна відчула, "
                   "що душа її стала на місце і спатиме вона спокійно (О. Гончар)."
    },
    {
        "title": "Жива душа",
        "description": "людина; живий, з ознаками життя.",
        "example": "Єсть у мене діти, та де їх подіти? Заховать з собою? — гріх, душа жива (Т. Шевченко)."
    },
    {
        "title": "Заяча душа",
        "description": "боязка, полохлива людина; уживається для вираження незадоволення, роздратування "
                       "з приводу чого-небудь.",
        "example": "Нічого, крім презирства, в неї [Ольги] до цих паненят нема, всі вони заячі душі (Я. Качура)."
    },
    {
        "title": "Каїнова душа",
        "description": "зрадлива, підступна людина.",
        "example": "Люди зневажали його і називали каїновою душею за підлий характер (3 усн. мови)."
    },
    {
        "title": "Кипить душа",
        "description": "хто-небудь перебуває у стані сильного нервового збудження, хвилювання; "
                       "хто-небудь гнівається, сердиться на когось-щось, обурюється з приводу чогось.",
        "example": "— Душа в мене кипить од безчесної гадки! Через якісь погані .. "
                   "халупи хотять [хочуть] оддати на руїну осередок держави! (І. Нечуй-Левицький)."
    },
    {
        "title": "Куди тільки душа забажає",
        "description": "будь-куди, куди завгодно.",
        "example": "— А після лиману? Ще кудись були наміри [податися]? — Без намірів. "
                   "Куди душа забажає. . . Галасвіта (О. Гончар)."
    },
    {
        "title": "Ледве душа держиться",
        "description": "хто-небудь дуже слабий, кволий, ледве живий.",
        "example": "Значить, Ви ще пам ‘ятаєте, що десь далеко.. живе прихильна до Вас душа. "
                   "Правда, та душа ледве держиться в тілі (М. Коцюбинський)."
    },
    {
        "title": "Мишача душа",
        "description": "боязка, полохлива людина з дріб’язковістю, підлою вдачею.",
        "example": "— Великий Докучаєв!.. Мишачі душі з департаментів, скупі й лякливі (М. Рудь)."
    },
    {
        "title": "Ні одна жива душа",
        "description": "ніхто.",
        "example": "Густі ліси вкривали гори й яри .. В ті пущі не заходила ніколи ні одна жива душа "
                   "(І. Нечуй-Левицький)."
    },
    {
        "title": "Порожня душа",
        "description": "хто-небудь відчуває душевну спустошеність, байдужість до навколишнього світу, "
                       "перебуває у стані депресії.",
        "example": "Я тільки з рейду... Губи, мов крейда, порожня душа (В. Сосюра)."
    },
    {
        "title": "Скільки душа забажає",
        "description": "дуже багато, у великій кількості; досхочу, без будь-яких обмежень.",
        "example": "[Юсуф:] В мене срібла-золота скільки твоя душа забажає. Я всю тебе обсиплю золотом, "
                   "тільки будь весела! (І. Нечуй-Левицький)."
    },
    {
        "title": "Тільки душа в тілі",
        "description": "бідний, убогий.",
        "example": "\"Отак увесь вік свій прожила, — дума.. баба Сикліта, — тільки душа в тілі \" (Грицько Григоренко)."
    },
    {
        "title": "Тільки сама душа залишилася",
        "description": "хто-небудь зовсім зубожів, збіднів.",
        "example": "— Хоч би ще троячку накинули, — .. кидає фурман. — Май, Онуфрію, совість! "
                   "— гримнула на нього Петрівна. — Бачиш, що у чоловіка тільки сама душа залишилася (М. Стельмах)."
    },
    {
        "title": "Черства душа",
        "description": "хто-небудь нечуйний, байдужий.",
        "example": "[Прохор:] Ти .. брат, а душа в тебе черства (І. Микитенко); "
                   "— Фесенко людина з черствим серцем, людина з матеріальним поглядом на все (І. Нечуй-Левицький)."
    },
    {
        "title": "Чого тільки душа забажає",
        "description": "у достатній кількості, доволі; те, до чого хто-небудь має потяг або чого хоче досягти.",
        "example": "Нічого Бога гнівити, досі ми гаразд малися. Було всього, чого тільки душа бажа (І. Чендей)."
    },
    {
        "title": "Чорнильна душа",
        "description": "хто-небудь обмежений у своїй діяльності вузькими службовими обов’язками, "
                       "інтересами; бюрократ, канцелярист.",
        "example": "— Нетаючись, скажу тобі: чорнильна душа була в мене. Опріч казенщини "
                   "— там губернських та сенатських відомостей — і в руки нічого не хотілось узяти (М. Коцюбинський)."
    },
    {
        "title": "Широка душа",
        "description": "хто-небудь чуйний, щедрий, щирий; чуйна, щедра, щира вдача у кого-небудь.",
        "example": "[Вася:] Що тобі відомо? Мені відомо тільки, що в нього широка і щира душа (І. Микитенко)."
    },
    {
        "title": "Щира душа",
        "description": "чесна, відверта, щедра, доброзичлива людина.",
        "example": "Прохор Осауленко був козак не з величних, щира душа, себе на посміх не подасть (П. Куліш)."
    },
    {
        "title": "Як душа до душі",
        "description": "щиро, відверто, правдиво.",
        "example": "Дівчино-серденько! Скажи нам усю щиру правду, як душа до душі (Марко Вовчок)."
    },
    {
        "title": "Як одна душа",
        "description": "дружно, в злагоді.",
        "example": "І зажили молоді як одна душа — дружно, весело (3 усн. мови)."
    },
    {
        "title": "По душах",
        "description": "щиро, відверто, щиросердно.",
        "example": "Інші, мовляв, по кабінетах, на телефонах сидять, а він не з таких .. "
                   "Звик отут, на місці, .. настрій маси вивчати. Тут з роботягами побесідуєш по душах, "
                   "щось їм цікаве підкинеш... (О.Гончар)."
    },
    {
        "title": "Душею і серцем",
        "description": "самовіддано, щиро.",
        "example": "Душем і серцем до Вас прихильний П. Рудченко (Панас Мирний)."
    },
    {
        "title": "Душею і тілом",
        "description": "повністю, до кінця, всім єством; щиро, самовіддано; у всіх відношеннях.",
        "example": "Душею і тілом був [Глухенький] відданий артілі (О. Гончар)."
    },
    {
        "title": "За душею",
        "description": "при собі, у власності, у наявності; затаїти у собі.",
        "example": "Ну-ну, сестро, ну! Викладай, викладай, що затаїла за душею (Панас Мирний)."
    },
    {
        "title": "З відкритою душею",
        "description": "щиро, радісно.",
        "example": "— Знаєш, як тебе там зустрінуть? Бачив, як нас зустрічала Словакія? "
                   "З дзвонами, квітами, з відкритою душею! (О. Гончар)."
    },
    {
        "title": "З дорогою душею",
        "description": "охоче, з великим задоволенням, з радістю.",
        "example": "[Храпко:] Нуте лиш, я вам оце дільце припоручу. [Печариця:] "
                   "Я з дорогою душею, та чи втну його? (Панас Мирний)."
    },
    {
        "title": "З душею",
        "description": "повністю, до кінця.",
        "example": "Ви, може, читали [поетові] вірші і переклади в 'Правді'. "
                   "З 'їли хлопця, схрупали з душею (Леся Українка)."
    },
    {
        "title": "Над душею",
        "description": "набридливо, невідступно перебувати біля кого-небудь.",
        "example": "Йому [Миколі] заманулося піти до неї [Нимидори], .. хоч подивитися на неї, "
                   "та гуменний стовбичив над душею (І. Нечуй-Левицький)."
    },
    {
        "title": "Без душі",
        "description": "дуже сильно, до самозабуття; заст. Мертвий; дуже переляканий; "
                       "сухо, формально, по-казенному.",
        "example": "[Виборний:] Наталка без душі його [Петра] любить, через його всім женихам одказує "
                   "(І. Котляревський)."
    },
    {
        "title": "В душі",
        "description": "приховано, нишком, не виявляючи зовні своїх почуттів.",
        "example": "— Я розскрекоталась, як сорока, а ви .. мовчите. Певне, "
                   "смієтеся в душі наді мною, що так безнастанно говорю! (Л. Мартович)."
    },
    {
        "title": "Від усієї душі",
        "description": "щиро, глибоко, сердечно; нестримно, невимушено; з великим задоволенням; "
                       "відверто, нічого не приховуючи; дже сумлінно, з надзвичайною старанністю.",
        "example": "Дзвеніла [пісня] в зоряній тиші, у простір місячний лилася про тих дівчат, "
                   "що на Донбасі усе робили від душі (О. Гончар)."
    },
    {
        "title": "Для душі",
        "description": "для задоволення власних духовних запитів, потреб.",
        "example": "Для душі художник писав не респектабельних чиновників чи їхніх .. дружин. "
                   "Своїх натурщиків він шукав на вулицях.., на .. базарах і в маленьких шинках (3 журналу)."
    },
    {
        "title": "До душі",
        "description": "подобатися; відповідний чиїм-небудь уподобанням, смакам.",
        "example": "Іван Михалчевський був нежонатий. Йому вже минуло двадцять шість років, "
                   "і він не міг знайти собі дівчину до душі (І. Нечуй-Левицький)."
    },
    {
        "title": "Жодної живої душі",
        "description": "нікого.",
        "example": "Настала така тиша, наче на всьому дворі не було живої душі (І. Нечуй-Левицький)."
    },
    {
        "title": "На душі",
        "description": "хто-небудь сповнений якимись почуттями, відчуває щось.",
        "example": "Нікого не цікавить, що було у вас на душі або дома, коли ви робили фільм .. "
                   "Ви мусите показати товар лицем (О. Довженко)."
    },
    {
        "title": "Ні живої душі",
        "description": "абсолютно нікого, жодної людини.",
        "example": "Хоч ні душі нема близько, а їй здається, буцімто усі люди так на неї і "
                   "дивляться (Г. Квітка-Основ’яненко)."
    },
    {
        "title": "В одну душу",
        "description": "настирливо, набридливо; невідступно вимагати що-небудь.",
        "example": "Важко було заспокоїти дитину, що верещала в одну душу (Грицько Григоренко)."
    },
    {
        "title": "За милу душу",
        "description": "з великим задоволенням, охоче; добре, прекрасно, надійно.",
        "example": "...— Пий, Гошко, бо ти дурний.. Я б тобі вліпив кулю в потилицю за милу душу (Григорій Тютюнник)."
    },
    {
        "title": "За пухлу душу",
        "description": "марно, даром.",
        "example": "Марно, даром. Робить за пухлого душу (Укр.. присл..)."
    },
    {
        "title": "З горобину душу",
        "description": "дуже мало.",
        "example": "Там у нього [у турка] війська було з горобину душу (С. Добровольський)."
    },
    {
        "title": "Ні за цапову душу",
        "description": "марно, даром; ні за що.",
        "example": "Пропав ні за цапову душу (Укр.. присл..)."
    },
    {
        "title": "Як свою душу",
        "description": "дуже (любити).",
        "example": "Дуже. Поважав же і він [Наум] її [дружину], скільки міг, і любив її як свою душу "
                   "(Г. Квітка-Основ’яненко)."
    },
{
        "title": "Аж крається серце",
        "description": "хто-небудь дуже переживає, страждає.",
        "example": "Краялись душі хлоп 'ятам від жалю (О. Гончар)."
    },
    {
        "title": "Аж серце тремтить",
        "description": "хто-небудь дуже хвилюється з приводу чого-небудь.",
        "example": "[Орися]: Я коня напуваю, а сама боюсь і глянуть на його, а серце так і тремтить... (С. Васильченко)."
    },
    {
        "title": "Аж захололо серце",
        "description": "хто-небудь дуже непокоїться, переживає; кого-небудь охопило почуття страху, комусь дуже страшно, боязно.",
        "example": "І от знову увижається мені страшна темнота .. Тихо... Глухо... страшно, аж в серці холоне (Панас Мирний)."
    },
    {
        "title": "Велике серце",
        "description": "хто-небудь дуже добрий, чуйний, здатний перейматися чиїмись переживаннями, горем.",
        "example": "Спитала [Тамара] несміливо. — Зара?! — Очі Божени засиніли теплими вогниками. Вона довго підбирала слова. — У неї велике серце... (А. Хижняк)."
    },
    {
        "title": "Відкрите серце",
        "description": "хто-небудь прямий, щирий, відвертий у стосунках з людьми.",
        "example": "Він [Сеспель] вірив Пакришневі, знав, що той каже правду, бо упевнився, що у своєму житті не зустрічав сердечнішого друга, людини з таким щирим і відкритим серцем (Ю. Збанацький)."
    },
    {
        "title": "Віщує серце",
        "description": "хто-небудь відчуває наближення певних подій (перев. неприємних).",
        "example": "Чогось їй було сумно, чогось було журно. Наче віщувало серце якесь лихо несподіване (М. Коцюбинський)."
    },
    {
        "title": "Гаряче серце",
        "description": "хто-небудь сповнений пристрасті, здатний на сильні почуття.",
        "example": "В той самий момент, коли одірвали Марусю од Василя, вона почула, яке то гаряче любляче серце, який він рідний (Г. Хоткевич)."
    },
    {
        "title": "Добре серце",
        "description": "лагідний, доброзичливий характер.",
        "example": "Подруги в Уляні душі не чули. Любили в Уляні щиру душу, добре серце (Панас Мирний)."
    },
    {
        "title": "Заворушилося серце",
        "description": "у кого-небудь виникло почуття кохання, хто-небудь відчув потяг до когось.",
        "example": "— Душа вся стривожена. Серце одразу заворушилось. Яка краса в тих чорних кучерях та смуглявих рум'янцях! — подумала Гризельда (І. Нечуй-Левицький)."
    },
    {
        "title": "Заграло серце",
        "description": "хто-небудь відчув радість, піднесення, задоволення.",
        "example": "Ломницький .. згадав, що зараз побачиться з Марусею, і його серце заграло (І. Нечуй-Левицький)."
    },
    {
        "title": "Запалилося серце",
        "description": "кого-небудь охопило сильне почуття (кохання, ненависті і т. ін.).",
        "example": "Єремія не зводив очей з пишного личка гарної козачки… Запалилось серце одразу, наче якимись чарами (І. Нечуй-Левицький)."
    },
    {
        "title": "Запеклося серце",
        "description": "хто-небудь від тривалих переживань став нечулим, байдужим до навколишнього світу; хто-небудь дуже перейнявся якимось почуттям (жалем, тугою і т. ін.).",
        "example": "Плакала б, так вже й сліз нема, так вже серце запеклось (Г. Квітка-Основ’яненко)."
    },
    {
        "title": "Кам’яне серце",
        "description": "хто-небудь байдужий, нечулий.",
        "example": "Ширяв скоса, …поглянув на художника. Але чиє кам'яне серце не зворушать похвали і лестощі…? (О. Іваненко)."
    },
    {
        "title": "Кривавиться серце",
        "description": "хто-небудь мучиться, страждає.",
        "example": "І кривавиться серце, читаючи повість вашу, гуцули, .. повість боротьби вашої (Г. Хоткевич)."
    },
    {
        "title": "Перестало битися серце",
        "description": "хто-небудь помер; хто-небудь завмер, заціпенів від страху, переляку.",
        "example": "Мов вритий, став опришок... серце перестало битися... \"Що се? ... Хто се?.. ” (Г. Хоткевич)."
    },
    {
        "title": "Прокинулося серце",
        "description": "хто-небудь знову відчуває інтерес до життя.",
        "example": "В неї прокинулось ще раз серце, прокинулось кохання до Ястшембського (І. Нечуй-Левицький)."
    },
    {
        "title": "Розбилося серце",
        "description": "хто-небудь став нещасним, зазнав краху, невдачі в чому-небудь.",
        "example": "Розбилось серце, зів'яв навіки надії цвіт. Пречиста Мати, прийми мене (Переклад М. Лукаша)."
    },
    {
        "title": "Пом'якшало серце",
        "description": "хто-небудь розчулився, став добрим, лагідним.",
        "example": "Сіла сердешна мати кінець столу да [та] так же то гірко почала плакати, що й старе запорозьке серце трохи пом'якшало (П. Куліш)."
    },
    {
        "title": "Серце бере/взяло",
        "description": "хтось сердиться, гнівається на кого-небудь.",
        "example": "Іноді ні з того, ні з сього візьме його таке серце на Ясочку, що так взяв би та спідтишка й садонув би під \"микитки\" (С. Васильченко)."
    },
    {
        "title": "Серце б'ється",
        "description": "хто-небудь живе заради когось, відданий комусь; кого-небудь охоплює якесь почуття.",
        "example": "Хіба серце б'ється не для неї?.. І чому вона не птиця? Чому в неї не виросли крила? (Панас Мирний)."
    },
    {
        "title": "Серце болить / заболіло",
        "description": "хто-небудь тяжко переживає з якогось приводу, уболіває, тривожиться за кого-, що-небудь.",
        "example": "Дітки плачуть, а в матері серце болить (М. Номис)."
    },
    {
        "title": "Серце в’яне",
        "description": "хто-небудь переживає, непокоїться; хто-небудь захоплюється кимсь.",
        "example": "Хто йде, хто їде — на темницю гляне. Холодний погляд!.. Ох, як серце в’яне (Леся Українка)."
    },
    {
        "title": "Серце мре",
        "description": "хто-небудь дуже хвилюється, відчуває раптовий переляк, страх, тривогу і т. ін.",
        "example": "Впізнала [Єлька] його [Миколу], і серце завмерло, а він ішов понурий, задуманий, під ноги дививсь (О. Гончар)."
    },
    {
        "title": "Серце ниє",
        "description": "хто-небудь дуже переживає, страждає.",
        "example": "“Господи! Де ж се вона ділася!.. \" Ниє-омлівас материне серце (Панас Мирний)."
    },
    {
        "title": "Серце обкипає",
        "description": "хто-небудь відчуває неспокій, тяжко переживає.",
        "example": "У неї серце обкипає кров’ю, коли подума вона, яке горе, яку нужду та недостачу терпить її Йосип (Панас Мирний)."
    },
    {
        "title": "Серце опинилось в п’ятах",
        "description": "хтось дуже злякався.",
        "example": "— Ану, раб Божий, постав ослона й лягай! — сказав [дяк] спокійно, з притиском, так що в хлопців серце миттю опинилося в п’ятах (Василь Шевчук)."
    },
    {
        "title": "Серце падає",
        "description": "хто-небудь завмирає від раптового переляку, тривоги і т. ін.",
        "example": "Я прислухавсь. Найменший шелест або стук — і моє серце надає (М. Коцюбинський)."
    },
    {
        "title": "Серце переболіло",
        "description": "хто-небудь настраждався, знемігся від почуття тривоги, страху, туги і т. ін.",
        "example": "А скільки сліз вилила за ним! А скільки серце в мене переболіло, як пішов він на чужину! (І. Нечуй-Левицький)."
    },
    {
        "title": "Серце повертається",
        "description": "хто-небудь починає прихильно ставитися, відчувати симпатію, любов до когось; хто-небудь перейнявся співчуттям, жалем до когось.",
        "example": "Ні, не таким було кохання його [Данила] до дівчини Її серце вже поверталося до Нечуйвітра, коли Данило побачив Галину (М. Стельмах)."
    },
    {
        "title": "Серце привертається",
        "description": "хто-небудь відчуває потяг, симпатію, любов до когось.",
        "example": "Приверталось її серце до Романа (М. Стельмах)."
    },
    {
        "title": "Серце рветься",
        "description": "хто-небудь дуже переживає, страждає, сумує.",
        "example": "[Кассандра:] Долон не винен. Винні сії очі, Не вмів їх погляд мовити \"кохаю\", Хоч від кохання серце розривалось (Леся Українка)."
    },
    {
        "title": "Серце сохне",
        "description": "хто-небудь томиться, знемагає від кохання.",
        "example": "Та минали дні і ночі, минали місяці, а той, за ким сохло її серце, не з'являвся перед батьківський двір (Д. Бедзик)."
    },
    {
        "title": "Серце стигне",
        "description": "у кого-небудь зменшилася сила вияву якихось почуттів (кохання, ненависті і т. ін.); кому-небудь дуже страшно, боязко.",
        "example": "Вона устала така веселенька, хоч і вчора її лаяно, та дитяче серце скоро стигне, образи швидко холонуть (Панас Мирний)."
    },
    {
        "title": "Серце стискається",
        "description": "хто-небудь тривожиться, хвилюється, відчуває неспокій за когось.",
        "example": "Коли згадую про нього, стискається серце (М. Коцюбинський)."
    },
    {
        "title": "Серце тенькає",
        "description": "хто-небудь починає дуже хвилюватися, тривожитися з приводу чого-небудь.",
        "example": "Тітка Мокрина, хоч в самої тенькає серце, може заспокоювати та вговоряти (Марко Вовчок)."
    },
    {
        "title": "Серце як не вискочить",
        "description": "хто-небудь відчуває сильне серцебиття від хвилювання, страху і т. ін.",
        "example": "Лежать груші — тут, там, ждуть, а в кожного з нас серце як не вискочить. Господар, сам .. дає.., нікого .. не промине (О. Гончар)."
    },
    {
        "title": "Тане серце",
        "description": "хто-небудь сповнюється приємними почуттями, піддаючись впливові когось, чогось приємного.",
        "example": "Олімпіада Никанорівна любила красивих людей, а Чумак виявився якраз таким парубком, перед якими в молодості тануло її серце (Ю. Збанацький)."
    },
    {
        "title": "Тьохкає серце",
        "description": "хтось сповнений почуттям кохання.",
        "example": "У дійсності вони чують себе і душею, і серцем, вони одна цілість, особливо коли котрась чи котрийсь має отам в тому гурті когось, до кого тьохкає серце (У. Самчук)."
    },
    {
        "title": "У саме серце",
        "description": "дуже сильно, надзвичайно.",
        "example": "В кожному його слові було стільки сили, .. що натовп, вражений в саме серце, застиг (О. Довженко)."
    },
    {
        "title": "Щемить / защеміло серце",
        "description": "хто-небудь сумує, журиться; хто-небудь відчуває піднесення, має добрий настрій.",
        "example": "І щемить їй серце, болить, як зранене (Григорій Тютюнник) / Серце старого гірника співало, солодко щеміло від радісного передчуття (Д. Ткач)."
    },
    {
        "title": "Ятриться серце",
        "description": "хто-небудь дуже переживаючи, розтравляє, посилює відчуття чогось болісного, важкого.",
        "example": "Іван лежав збуджений, бентежний, серце йому ятрилось (О. Гончар)."
    },
    {
        "title": "Всім серцем",
        "description": "щиро, гаряче; зісл. співчувати, розуміти і под.; цілком, повністю, до кінця.",
        "example": "Любіть Україну всім серцем своїм і всіми своїми ділами!.. (В. Сосюра)"
    },
    {
        "title": "З важким серцем",
        "description": "у гнітючому стані, в тривозі, у передчутті чогось неприємного.",
        "example": "З важким серцем ішов Максим Беркут посеред невеличкої ватаги (І. Франко)."
    },
    {
        "title": "З легким серцем",
        "description": "без будь-якої тривоги, без жалю, вагань, переживань.",
        "example": "Ви не думайте, що я на легкім хлібу виросла і так собі, з легким серцем на легкий хліб пустилася! (І. Франко)."
    },
    {
        "title": "З серцем",
        "description": "сердито, з гнівом, зі злістю (про мовлення, дії тощо).",
        "example": "— А як тато не прийме мене? — То нехай собі робить з тобою, що хоче! — з серцем промовила Василиха (І. Франко)."
    },
    {
        "title": "З щирим серцем",
        "description": "з довірою.",
        "example": "— Я до вас а щирим серцем, а ви до мене з хитрощами.. Ну, що в вас на мислі? (П. Куліш)."
    },
    {
        "title": "Чистим серцем",
        "description": "щиро, з добрим наміром.",
        "example": "Поблагословила [Ганна] Свого Марка... заплакала Й пішла за ворота (Т. Шевченко)."
    },
    {
        "title": "Щирим серцем",
        "description": "віддаючи всі сили, самовіддано.",
        "example": "Робить [Андрійко] і діло, щирим серцем робить, а годинку урве собі на гуляння парубоцьке (Марко Вовчок);"
    },
    {
        "title": "По серцю / До серця",
        "description": "кому-небудь хтось або щось подобається, підходить.",
        "example": "Еней був тяжко не по серцю Юноні, — все її гнівив (І. Котляревський); / Почував себе [Дорош] збудженим і трохи схвильованим від того, .. що немає вже військової служби, .. яка ніколи не була йому до серця (Григорій Тютюнник)."
    },
    {
        "title": "Без серця",
        "description": "жорстокий, безжалісний; безжалісно, не шкодуючи нікого, нічого; не гніваючись або без злості; пересердившись.",
        "example": "Ще треба буде одну ніч ночувати у того чоловіка без серця (І. Франко). / — Скажи, хлопе, — .. без серця звернулася вона до Івасикового батька, — ти навіщо паскудиш мій ліс? (Д. Бедзик)."
    },
    {
        "title": "Від (усього) серця",
        "description": "щиро; нестримно; дуже сумлінно, з надзвичайною старанністю.",
        "example": "Співаючи пісню, од серця голосить [дідусь] і до плачу доводить (П. Куліш)."
    },
    {
        "title": "Від щирого серця",
        "description": "палко, гаряче; відверто, чистосердечно, не приховуючи нічого, чесно; нестримно.",
        "example": "Що ж їй тут казати? Вона від щирого серця тут і каже: “Як же вас ще полюбити?” (Г. Квітка-Основ’яненко)."
    },
    {
        "title": "З доброго серця",
        "description": "по-доброму, без злого наміру.",
        "example": "– Я з доброго серця питаю, – чи то правда, що родичі хочуть панну цю продати баронові (І. Франко)."
    }
]

